Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# InsertFile_Insert
source: Insert
ar: إدراج
cs: Vložit
de: Einfügen
el: Εισαγωγή
es: Insertar
fa: درج
fr: Insérer
hu: Beszúrás
id: Sisipkan
it: Inserisci
ja: 挿入
ko: 삽입
pl: Wstaw
pt: Inserir
ro: Inserare
ru: Вставить
th: แทรก
tr: Ekle
uk: Вставити
vi: Chèn
zh_hans: 插入
zh_hant: 插入

# InsertFile_Overwrite
source: Overwrite
ar: كتابة فوقية
cs: Přepsat
de: Überschreiben
el: Αντικατάσταση
es: Sobrescribir
fa: بازنویسی
fr: Remplacer
hu: Felülírás
id: Timpa
it: Sovrascrivi
ja: 上書き
ko: 덮어쓰기
pl: Zastąp
pt: Substituir
ro: Suprascriere
ru: Заменить
th: เขียนทับ
tr: Üzerine yaz
uk: Замінити
vi: Ghi đè
zh_hans: 改写
zh_hant: 覆寫

# InsertFile_Run
source: Run
ar: تشغيل
cs: Spustit
de: Ausführen
el: Εκτέλεση
es: Ejecutar
fa: اجرا
fr: Exécuter
hu: Futtatás
id: Jalankan
it: Esegui
ja: 実行
ko: 실행
pl: Uruchom
pt: Executar
ro: Executare
ru: Выполнить
th: เรียกใช้
tr: Çalıştır
uk: Виконати
vi: Chạy
zh_hans: 运行
zh_hant: 執行

# InsertFile_Error_Offset
source: The start is past the end of the file.
ar: البداية تتجاوز نهاية الملف.
cs: Začátek je za koncem souboru.
de: Der Anfang liegt hinter dem Dateiende.
el: Η αρχή βρίσκεται μετά το τέλος του αρχείου.
es: El inicio está más allá del final del archivo.
fa: شروع از انتهای فایل فراتر است.
fr: Le début se situe après la fin du fichier.
hu: A kezdet a fájl végén túl van.
id: Awal melewati akhir file.
it: L'inizio è oltre la fine del file.
ja: 開始位置がファイルの末尾を超えています。
ko: 시작 위치가 파일 끝을 넘습니다.
pl: Początek wykracza poza koniec pliku.
pt: O início está além do fim do arquivo.
ro: Începutul depășește sfârșitul fișierului.
ru: Начало находится за концом файла.
th: จุดเริ่มต้นเกินจุดสิ้นสุดของไฟล์
tr: Başlangıç dosyanın sonunu aşıyor.
uk: Початок за кінцем файлу.
vi: Vị trí bắt đầu vượt quá cuối tệp.
zh_hans: 起始位置超出文件末尾。
zh_hant: 起始位置超出檔案結尾。

# InsertFile_Range
source: From {0}, {1} bytes
ar: من {0}، {1} بايت
cs: Od {0}, bajty: {1}
de: Ab {0}, {1} Bytes
el: Από {0}, {1} byte
es: Desde {0}, {1} bytes
fa: از {0}، {1} بایت
fr: À partir de {0}, {1} octets
hu: Innen: {0}, {1} bájt
id: Dari {0}, {1} byte
it: Da {0}, {1} byte
ja: {0} から {1} バイト
ko: {0}부터 {1}바이트
pl: Od {0}, bajty: {1}
pt: A partir de {0}, {1} bytes
ro: De la {0}, {1} octeți
ru: С {0}, байт: {1}
th: จาก {0} จำนวน {1} ไบต์
tr: {0} konumundan, {1} bayt
uk: Від {0}, байтів: {1}
vi: Từ {0}, {1} byte
zh_hans: 从 {0} 开始，{1} 字节
zh_hant: 從 {0} 起 {1} 個位元組

# SelectRange_Title
source: Select Range
ar: تحديد نطاق
cs: Vybrat rozsah
de: Bereich auswählen
el: Επιλογή περιοχής
es: Seleccionar intervalo
fa: انتخاب محدوده
fr: Sélectionner une plage
hu: Tartomány kijelölése
id: Pilih Rentang
it: Seleziona intervallo
ja: 範囲を選択
ko: 범위 선택
pl: Zaznacz zakres
pt: Selecionar intervalo
ro: Selectare interval
ru: Выделение диапазона
th: เลือกช่วง
tr: Aralık Seç
uk: Виділення діапазону
vi: Chọn phạm vi
zh_hans: 选择范围
zh_hant: 選取範圍

# SelectRange_Start
source: Start
ar: البداية
cs: Začátek
de: Anfang
el: Αρχή
es: Inicio
fa: شروع
fr: Début
hu: Kezdet
id: Awal
it: Inizio
ja: 開始
ko: 시작
pl: Początek
pt: Início
ro: Început
ru: Начало
th: เริ่มต้น
tr: Başlangıç
uk: Початок
vi: Đầu
zh_hans: 开始
zh_hant: 開始

# SelectRange_End
source: End (this byte included)
ar: النهاية (يشمل هذا البايت)
cs: Konec (včetně tohoto bajtu)
de: Ende (dieses Byte eingeschlossen)
el: Τέλος (συμπεριλαμβάνεται αυτό το byte)
es: Fin (incluido este byte)
fa: پایان (شامل این بایت)
fr: Fin (cet octet inclus)
hu: Vég (ezzel a bájttal együtt)
id: Akhir (termasuk byte ini)
it: Fine (byte incluso)
ja: 終了 (このバイトを含む)
ko: 끝(이 바이트 포함)
pl: Koniec (z tym bajtem)
pt: Fim (este byte incluído)
ro: Sfârșit (inclusiv acest octet)
ru: Конец (включая этот байт)
th: สิ้นสุด (รวมไบต์นี้)
tr: Bitiş (bu bayt dahil)
uk: Кінець (включно з цим байтом)
vi: Cuối (bao gồm byte này)
zh_hans: 结束（含此字节）
zh_hant: 結束（包含此位元組）

# SelectRange_Length
source: Length
ar: الطول
cs: Délka
de: Länge
el: Μήκος
es: Longitud
fa: طول
fr: Longueur
hu: Hossz
id: Panjang
it: Lunghezza
ja: 長さ
ko: 길이
pl: Długość
pt: Comprimento
ro: Lungime
ru: Длина
th: ความยาว
tr: Uzunluk
uk: Довжина
vi: Độ dài
zh_hans: 长度
zh_hant: 長度

# SelectRange_ClampEnd
source: Up to the end
ar: حتى النهاية
cs: Až do konce
de: Bis zum Ende
el: Έως το τέλος
es: Hasta el final
fa: تا انتها
fr: Jusqu'à la fin
hu: A végéig
id: Hingga akhir
it: Fino alla fine
ja: 末尾までにする
ko: 끝까지
pl: Do końca
pt: Até o fim
ro: Până la sfârșit
ru: До конца
th: จนถึงจุดสิ้นสุด
tr: Sona kadar
uk: До кінця
vi: Đến cuối
zh_hans: 到末尾为止
zh_hant: 到結尾為止

# SelectRange_ModeNew
source: New selection
ar: تحديد جديد
cs: Nový výběr
de: Neue Auswahl
el: Νέα επιλογή
es: Nueva selección
fa: انتخاب جدید
fr: Nouvelle sélection
hu: Új kijelölés
id: Pilihan baru
it: Nuova selezione
ja: 新しい選択
ko: 새 선택 영역
pl: Nowe zaznaczenie
pt: Nova seleção
ro: Selecție nouă
ru: Новое выделение
th: การเลือกใหม่
tr: Yeni seçim
uk: Нове виділення
vi: Vùng chọn mới
zh_hans: 新建选定内容
zh_hant: 新的選取範圍

# SelectRange_ModeExtend
source: Extend the current selection
ar: توسيع التحديد الحالي
cs: Rozšířit aktuální výběr
de: Aktuelle Auswahl erweitern
el: Επέκταση της τρέχουσας επιλογής
es: Ampliar la selección actual
fa: گسترش انتخاب فعلی
fr: Étendre la sélection actuelle
hu: Az aktuális kijelölés bővítése
id: Perluas pilihan saat ini
it: Estendi la selezione corrente
ja: 現在の選択を広げる
ko: 현재 선택 영역 확장
pl: Rozszerz bieżące zaznaczenie
pt: Estender a seleção atual
ro: Extindere selecție curentă
ru: Расширить текущее выделение
th: ขยายส่วนที่เลือกปัจจุบัน
tr: Geçerli seçimi genişlet
uk: Розширити поточне виділення
vi: Mở rộng vùng chọn hiện tại
zh_hans: 扩展当前选定内容
zh_hant: 擴充目前的選取範圍

# SelectRange_ScrollToStart
source: Go to the start after selecting
ar: الانتقال إلى البداية بعد التحديد
cs: Po výběru přejít na začátek
de: Nach dem Auswählen zum Anfang springen
el: Μετάβαση στην αρχή μετά την επιλογή
es: Ir al inicio después de seleccionar
fa: رفتن به شروع پس از انتخاب
fr: Aller au début après la sélection
hu: Ugrás a kezdetre kijelölés után
id: Pergi ke awal setelah memilih
it: Vai all'inizio dopo la selezione
ja: 選択後に開始位置へ移動
ko: 선택 후 시작 위치로 이동
pl: Przejdź do początku po zaznaczeniu
pt: Ir para o início após selecionar
ro: Salt la început după selectare
ru: Перейти к началу после выделения
th: ไปที่จุดเริ่มต้นหลังจากเลือก
tr: Seçtikten sonra başlangıca git
uk: Після виділення перейти до початку
vi: Đi tới đầu sau khi chọn
zh_hans: 选择后转到开头
zh_hant: 選取後移至開頭

# SelectRange_Select
source: Select
ar: تحديد
cs: Vybrat
de: Auswählen
el: Επιλογή
es: Seleccionar
fa: انتخاب
fr: Sélectionner
hu: Kijelölés
id: Pilih
it: Seleziona
ja: 選択
ko: 선택
pl: Zaznacz
pt: Selecionar
ro: Selectare
ru: Выделить
th: เลือก
tr: Seç
uk: Виділити
vi: Chọn
zh_hans: 选择
zh_hant: 選取

# SelectRange_Computed
source: Calculated
ar: محسوبة
cs: Vypočteno
de: Berechnet
el: Υπολογισμένο
es: Calculado
fa: محاسبه‌شده
fr: Calculé
hu: Számított
id: Terhitung
it: Calcolato
ja: 計算した値
ko: 계산된 값
pl: Obliczone
pt: Calculado
ro: Calculat
ru: Вычислено
th: ค่าที่คำนวณ
tr: Hesaplanan
uk: Обчислено
vi: Đã tính
zh_hans: 计算值
zh_hant: 計算結果

# SelectRange_Error_StartBeyondEnd
source: The start is past the end of the file (length {0}).
ar: البداية تتجاوز نهاية الملف (الطول {0}).
cs: Začátek je za koncem souboru (délka {0}).
de: Der Anfang liegt hinter dem Dateiende (Länge {0}).
el: Η αρχή βρίσκεται μετά το τέλος του αρχείου (μήκος {0}).
es: El inicio está más allá del final del archivo (longitud {0}).
fa: شروع از انتهای فایل فراتر است (طول {0}).
fr: Le début se situe après la fin du fichier (longueur {0}).
hu: A kezdet a fájl végén túl van (hossz: {0}).
id: Awal melewati akhir file (panjang {0}).
it: L'inizio è oltre la fine del file (lunghezza {0}).
ja: 開始がファイルの末尾を超えています (長さ {0})。
ko: 시작이 파일 끝을 넘습니다(길이 {0}).
pl: Początek wykracza poza koniec pliku (długość {0}).
pt: O início está além do fim do arquivo (comprimento {0}).
ro: Începutul depășește sfârșitul fișierului (lungime {0}).
ru: Начало находится за концом файла (длина {0}).
th: จุดเริ่มต้นเกินจุดสิ้นสุดของไฟล์ (ความยาว {0})
tr: Başlangıç dosyanın sonunu aşıyor (uzunluk {0}).
uk: Початок за кінцем файлу (довжина {0}).
vi: Đầu vượt quá cuối tệp (độ dài {0}).
zh_hans: 开始位置超出文件末尾（长度 {0}）。
zh_hant: 開始位置超出檔案結尾（長度 {0}）。

# SelectRange_Error_EndBeyondEnd
source: The end is past the end of the file (length {0}).
ar: النهاية تتجاوز نهاية الملف (الطول {0}).
cs: Konec je za koncem souboru (délka {0}).
de: Das Ende liegt hinter dem Dateiende (Länge {0}).
el: Το τέλος βρίσκεται μετά το τέλος του αρχείου (μήκος {0}).
es: El fin está más allá del final del archivo (longitud {0}).
fa: پایان از انتهای فایل فراتر است (طول {0}).
fr: La fin se situe après la fin du fichier (longueur {0}).
hu: A vég a fájl végén túl van (hossz: {0}).
id: Akhir melewati akhir file (panjang {0}).
it: La fine è oltre la fine del file (lunghezza {0}).
ja: 終了がファイルの末尾を超えています (長さ {0})。
ko: 끝이 파일 끝을 넘습니다(길이 {0}).
pl: Koniec wykracza poza koniec pliku (długość {0}).
pt: O fim está além do fim do arquivo (comprimento {0}).
ro: Sfârșitul depășește sfârșitul fișierului (lungime {0}).
ru: Конец находится за концом файла (длина {0}).
th: จุดสิ้นสุดเกินจุดสิ้นสุดของไฟล์ (ความยาว {0})
tr: Bitiş dosyanın sonunu aşıyor (uzunluk {0}).
uk: Кінець за кінцем файлу (довжина {0}).
vi: Cuối vượt quá cuối tệp (độ dài {0}).
zh_hans: 结束位置超出文件末尾（长度 {0}）。
zh_hant: 結束位置超出檔案結尾（長度 {0}）。

# SelectRange_Error_EndBeforeStart
source: The end is before the start.
ar: النهاية قبل البداية.
cs: Konec je před začátkem.
de: Das Ende liegt vor dem Anfang.
el: Το τέλος βρίσκεται πριν από την αρχή.
es: El fin está antes del inicio.
fa: پایان پیش از شروع است.
fr: La fin précède le début.
hu: A vég a kezdet előtt van.
id: Akhir berada sebelum awal.
it: La fine precede l'inizio.
ja: 終了が開始より前です。
ko: 끝이 시작보다 앞에 있습니다.
pl: Koniec jest przed początkiem.
pt: O fim está antes do início.
ro: Sfârșitul se află înaintea începutului.
ru: Конец находится перед началом.
th: จุดสิ้นสุดอยู่ก่อนจุดเริ่มต้น
tr: Bitiş, başlangıçtan önce.
uk: Кінець розташовано перед початком.
vi: Cuối nằm trước đầu.
zh_hans: 结束位置在开始位置之前。
zh_hant: 結束位置在開始位置之前。

# CopyAs_Title
source: Copy As
ar: نسخ بتنسيق
cs: Kopírovat jako
de: Kopieren als
el: Αντιγραφή ως
es: Copiar como
fa: رونوشت به‌صورت
fr: Copier sous
hu: Másolás másként
id: Salin Sebagai
it: Copia come
ja: 形式を選択してコピー
ko: 다른 형식으로 복사
pl: Kopiuj jako
pt: Copiar como
ro: Copiere ca
ru: Копировать как
th: คัดลอกเป็น
tr: Farklı Kopyala
uk: Копіювати як
vi: Sao chép dạng
zh_hans: 复制为
zh_hant: 以格式複製

# CopyAs_Copy
source: Copy
ar: نسخ
cs: Kopírovat
de: Kopieren
el: Αντιγραφή
es: Copiar
fa: رونوشت
fr: Copier
hu: Másolás
id: Salin
it: Copia
ja: コピー
ko: 복사
pl: Kopiuj
pt: Copiar
ro: Copiere
ru: Копировать
th: คัดลอก
tr: Kopyala
uk: Копіювати
vi: Sao chép
zh_hans: 复制
zh_hant: 複製

# CopyAs_SaveToFile
source: Save to File...
ar: حفظ في ملف...
cs: Uložit do souboru...
de: In Datei speichern...
el: Αποθήκευση σε αρχείο...
es: Guardar en archivo...
fa: ذخیره در فایل...
fr: Enregistrer dans un fichier...
hu: Mentés fájlba...
id: Simpan ke File...
it: Salva in un file...
ja: ファイルに保存...
ko: 파일에 저장...
pl: Zapisz do pliku...
pt: Salvar em arquivo...
ro: Salvare în fișier...
ru: Сохранить в файл...
th: บันทึกลงไฟล์...
tr: Dosyaya Kaydet...
uk: Зберегти у файл...
vi: Lưu vào tệp...
zh_hans: 保存到文件...
zh_hant: 儲存至檔案...

# CopyAs_Search
source: Search formats
ar: البحث في التنسيقات
cs: Hledat formáty
de: Formate durchsuchen
el: Αναζήτηση μορφών
es: Buscar formatos
fa: جستجوی قالب‌ها
fr: Rechercher des formats
hu: Formátumok keresése
id: Cari format
it: Cerca formati
ja: 形式を検索
ko: 형식 검색
pl: Szukaj formatów
pt: Pesquisar formatos
ro: Căutare formate
ru: Поиск форматов
th: ค้นหารูปแบบ
tr: Biçimlerde ara
uk: Пошук форматів
vi: Tìm định dạng
zh_hans: 搜索格式
zh_hant: 搜尋格式

# CopyAs_FormatsName
source: Formats
ar: التنسيقات
cs: Formáty
de: Formate
el: Μορφές
es: Formatos
fa: قالب‌ها
hu: Formátumok
id: Format
it: Formati
ja: 形式
ko: 형식
pl: Formaty
pt: Formatos
ro: Formate
ru: Форматы
th: รูปแบบ
tr: Biçimler
uk: Формати
vi: Định dạng
zh_hans: 格式
zh_hant: 格式

# CopyAs_PreviewName
source: Preview
ar: معاينة
cs: Náhled
de: Vorschau
el: Προεπισκόπηση
es: Vista previa
fa: پیش‌نمایش
fr: Aperçu
hu: Előnézet
id: Pratinjau
it: Anteprima
ja: プレビュー
ko: 미리 보기
pl: Podgląd
pt: Visualização
ro: Previzualizare
ru: Предварительный просмотр
th: ตัวอย่าง
tr: Önizleme
uk: Попередній перегляд
vi: Xem trước
zh_hans: 预览
zh_hant: 預覽

# CopyAs_Format_HexSpaced
source: Space separated
ar: مفصولة بمسافات
cs: Oddělené mezerou
de: Durch Leerzeichen getrennt
el: Διαχωρισμός με κενό
es: Separados por espacios
fa: جداشده با فاصله
fr: Séparés par des espaces
hu: Szóközzel elválasztva
id: Dipisahkan spasi
it: Separati da spazi
ja: 空白区切り
ko: 공백으로 구분
pl: Rozdzielone spacjami
pt: Separados por espaço
ro: Separat prin spații
ru: Через пробел
th: คั่นด้วยช่องว่าง
tr: Boşlukla ayrılmış
uk: Через пробіл
vi: Phân cách bằng dấu cách
zh_hans: 空格分隔
zh_hant: 以空格分隔

# CopyAs_Format_HexPlain
source: No separator
ar: بدون فاصل
cs: Bez oddělovače
de: Ohne Trennzeichen
el: Χωρίς διαχωριστικό
es: Sin separador
fa: بدون جداکننده
fr: Sans séparateur
hu: Elválasztó nélkül
id: Tanpa pemisah
it: Senza separatore
ja: 区切りなし
ko: 구분 기호 없음
pl: Bez separatora
pt: Sem separador
ro: Fără separator
ru: Без разделителя
th: ไม่มีตัวคั่น
tr: Ayırıcı yok
uk: Без роздільника
vi: Không có dấu phân cách
zh_hans: 无分隔符
zh_hant: 無分隔符號

# CopyAs_Format_HexCommaPrefixed
source: 0x, comma separated
ar: 0x، مفصولة بفواصل
cs: 0x, oddělené čárkou
de: 0x, durch Kommas getrennt
el: 0x, διαχωρισμός με κόμμα
es: 0x, separados por comas
fa: 0x، جداشده با کاما
fr: 0x, séparés par des virgules
hu: 0x előtaggal, vesszővel elválasztva
id: 0x, dipisahkan koma
it: 0x, separati da virgole
ja: 0x 付きカンマ区切り
ko: 0x, 쉼표로 구분
pl: 0x, rozdzielone przecinkami
pt: 0x, separados por vírgula
ro: 0x, separat prin virgule
ru: 0x, через запятую
th: 0x คั่นด้วยจุลภาค
tr: 0x, virgülle ayrılmış
uk: 0x, через кому
vi: 0x, phân cách bằng dấu phẩy
zh_hans: 0x 前缀，逗号分隔
zh_hant: 0x，以逗號分隔

# CopyAs_Format_HexEscaped
source: \x escapes
ar: تسلسلات هروب \x
cs: Řídicí sekvence \x
de: \x-Escapesequenzen
el: Ακολουθίες διαφυγής \x
es: Secuencias de escape \x
fa: گریزهای \x
fr: Séquences d'échappement \x
hu: \x escape-szekvenciák
id: Escape \x
it: Sequenze di escape \x
ja: \x エスケープ
ko: \x 이스케이프
pl: Sekwencje ucieczki \x
pt: Escapes \x
ro: Secvențe escape \x
ru: Escape-последовательности \x
th: ลำดับหลีก \x
tr: \x kaçış dizileri
uk: Escape-послідовності \x
vi: Chuỗi thoát \x
zh_hans: \x 转义
zh_hant: \x 逸出序列

# CopyAs_Format_HexUrl
source: URL encoding (all bytes)
ar: ترميز URL (كل البايتات)
cs: Kódování URL (všechny bajty)
de: URL-Codierung (alle Bytes)
el: Κωδικοποίηση URL (όλα τα byte)
es: Codificación URL (todos los bytes)
fa: رمزگذاری URL (همهٔ بایت‌ها)
fr: Encodage URL (tous les octets)
hu: URL-kódolás (minden bájt)
id: Pengodean URL (semua byte)
it: Codifica URL (tutti i byte)
ja: URL エンコード (全バイト)
ko: URL 인코딩(모든 바이트)
pl: Kodowanie URL (wszystkie bajty)
pt: Codificação de URL (todos os bytes)
ro: Codificare URL (toți octeții)
ru: URL-кодирование (все байты)
th: การเข้ารหัส URL (ทุกไบต์)
tr: URL kodlaması (tüm baytlar)
uk: URL-кодування (усі байти)
vi: Mã hóa URL (tất cả byte)
zh_hans: URL 编码（所有字节）
zh_hant: URL 編碼（所有位元組）

# CopyAs_Format_HexCustom
source: Custom separator
ar: فاصل مخصص
cs: Vlastní oddělovač
de: Benutzerdefiniertes Trennzeichen
el: Προσαρμοσμένο διαχωριστικό
es: Separador personalizado
fa: جداکنندهٔ سفارشی
fr: Séparateur personnalisé
hu: Egyéni elválasztó
id: Pemisah kustom
it: Separatore personalizzato
ja: 区切り文字を指定
ko: 사용자 지정 구분 기호
pl: Niestandardowy separator
pt: Separador personalizado
ro: Separator particularizat
ru: Свой разделитель
th: ตัวคั่นที่กำหนดเอง
tr: Özel ayırıcı
uk: Власний роздільник
vi: Dấu phân cách tùy chỉnh
zh_hans: 自定义分隔符
zh_hant: 自訂分隔符號

# CopyAs_Format_Decimal
source: Decimal
ar: عشري
cs: Desítkově
de: Dezimal
el: Δεκαδικό
fa: دهدهی
fr: Décimal
hu: Decimális
id: Desimal
it: Decimale
ja: 10 進
ko: 10진수
pl: Dziesiętny
ro: Zecimal
ru: Десятичный
th: ฐานสิบ
tr: Ondalık
uk: Десятковий
vi: Thập phân
zh_hans: 十进制
zh_hant: 十進位

# CopyAs_Format_Octal
source: Octal
ar: ثماني
cs: Osmičkově
de: Oktal
el: Οκταδικό
fa: هشت‌هشتی
hu: Oktális
id: Oktal
it: Ottale
ja: 8 進
ko: 8진수
pl: Ósemkowy
ru: Восьмеричный
th: ฐานแปด
tr: Sekizlik
uk: Вісімковий
vi: Bát phân
zh_hans: 八进制
zh_hant: 八進位

# CopyAs_Format_Binary
source: Binary
ar: ثنائي
cs: Binárně
de: Binär
el: Δυαδικό
es: Binario
fa: دودویی
fr: Binaire
hu: Bináris
id: Biner
it: Binario
ja: 2 進
ko: 2진수
pl: Binarny
pt: Binário
ro: Binar
ru: Двоичный
th: ฐานสอง
tr: İkili
uk: Двійковий
vi: Nhị phân
zh_hans: 二进制
zh_hant: 二進位

# CopyAs_Format_ArrayAssembly
source: Assembly
ar: لغة التجميع
cs: Assembler
de: Assembler
es: Ensamblador
fa: اسمبلی
fr: Assembleur
ja: アセンブリ
ko: 어셈블리
pl: Asembler
ro: Asamblare
ru: Ассемблер
th: แอสเซมบลี
uk: Асемблер
vi: Hợp ngữ
zh_hans: 汇编
zh_hant: 組合語言

# CopyAs_Format_ScreenDump
source: As shown on screen
ar: كما يظهر على الشاشة
cs: Jak je zobrazeno na obrazovce
de: Wie auf dem Bildschirm
el: Όπως εμφανίζεται στην οθόνη
es: Como se muestra en pantalla
fa: همان‌طور که روی صفحه نمایش داده می‌شود
fr: Tel qu'affiché à l'écran
hu: A képernyőn látható módon
id: Seperti di layar
it: Come mostrato sullo schermo
ja: 画面表示どおり
ko: 화면에 표시된 대로
pl: Tak jak na ekranie
pt: Como mostrado na tela
ro: Ca pe ecran
ru: Как на экране
th: ตามที่แสดงบนหน้าจอ
tr: Ekranda gösterildiği gibi
uk: Як на екрані
vi: Như hiển thị trên màn hình
zh_hans: 与屏幕显示相同
zh_hant: 與畫面顯示相同

# CopyAs_Format_Text
source: Text (decoded)
ar: نص (بعد فك الترميز)
cs: Text (dekódovaný)
de: Text (decodiert)
el: Κείμενο (αποκωδικοποιημένο)
es: Texto (descodificado)
fa: متن (رمزگشایی‌شده)
fr: Texte (décodé)
hu: Szöveg (dekódolva)
id: Teks (didekode)
it: Testo (decodificato)
ja: テキスト (文字コードで解釈)
ko: 텍스트(디코딩됨)
pl: Tekst (zdekodowany)
pt: Texto (decodificado)
ro: Text (decodificat)
ru: Текст (декодированный)
th: ข้อความ (ถอดรหัสแล้ว)
tr: Metin (kodu çözülmüş)
uk: Текст (декодований)
vi: Văn bản (đã giải mã)
zh_hans: 文本（已解码）
zh_hant: 文字（已解碼）

# CopyAs_Format_Position
source: Offset
ar: الإزاحة
cs: Posun
el: Μετατόπιση
es: Desplazamiento
fa: آفست
fr: Décalage
hu: Eltolás
ja: オフセット
ko: 오프셋
pl: Przesunięcie
pt: Deslocamento
ro: Deplasament
ru: Смещение
th: ออฟเซ็ต
tr: Ofset
uk: Зміщення
vi: Độ lệch
zh_hans: 偏移量
zh_hant: 位移

# CopyAs_Category_HexString
source: Hex string
ar: سلسلة Hex
cs: Řetězec Hex
de: Hex-Zeichenfolge
el: Συμβολοσειρά Hex
es: Cadena Hex
fa: رشتهٔ Hex
fr: Chaîne Hex
hu: Hex karakterlánc
id: String Hex
it: Stringa Hex
ja: Hex 文字列
ko: Hex 문자열
pl: Ciąg Hex
pt: Cadeia Hex
ro: Șir Hex
ru: Строка Hex
th: สตริง Hex
tr: Hex dizesi
uk: Рядок Hex
vi: Chuỗi Hex
zh_hans: Hex 字符串
zh_hant: Hex 字串

# CopyAs_Category_Numbers
source: Numbers
ar: أرقام
cs: Čísla
de: Zahlen
el: Αριθμοί
es: Números
fa: اعداد
fr: Nombres
hu: Számok
id: Angka
it: Numeri
ja: 数値列
ko: 숫자
pl: Liczby
pt: Números
ro: Numere
ru: Числа
th: ตัวเลข
tr: Sayılar
uk: Числа
vi: Số
zh_hans: 数字
zh_hant: 數字

# CopyAs_Category_Array
source: Array
ar: مصفوفة
cs: Pole
el: Πίνακας
es: Matriz
fa: آرایه
fr: Tableau
hu: Tömb
ja: 配列
ko: 배열
pl: Tablica
pt: Matriz
ro: Matrice
ru: Массив
th: อาร์เรย์
tr: Dizi
uk: Масив
vi: Mảng
zh_hans: 数组
zh_hant: 陣列

# CopyAs_Category_Encoding
source: Encoding
ar: ترميز
cs: Kódování
de: Codierung
el: Κωδικοποίηση
es: Codificación
fa: رمزگذاری
fr: Encodage
hu: Kódolás
id: Pengodean
it: Codifica
ja: エンコード
ko: 인코딩
pl: Kodowanie
pt: Codificação
ro: Codificare
ru: Кодирование
th: การเข้ารหัส
tr: Kodlama
uk: Кодування
vi: Mã hóa
zh_hans: 编码
zh_hant: 編碼

# CopyAs_Category_Document
source: Document
ar: مستند
cs: Dokument
de: Dokument
el: Έγγραφο
es: Documento
fa: سند
hu: Dokumentum
id: Dokumen
it: Documento
ja: 文書
ko: 문서
pl: Dokument
pt: Documento
ru: Документ
th: เอกสาร
tr: Belge
uk: Документ
vi: Tài liệu
zh_hans: 文档
zh_hant: 文件

# CopyAs_Category_Screen
source: Screen
ar: الشاشة
cs: Obrazovka
de: Bildschirm
el: Οθόνη
es: Pantalla
fa: صفحه
fr: Écran
hu: Képernyő
id: Layar
it: Schermo
ja: 画面表示
ko: 화면
pl: Ekran
pt: Tela
ro: Ecran
ru: Экран
th: หน้าจอ
tr: Ekran
uk: Екран
vi: Màn hình
zh_hans: 屏幕
zh_hant: 畫面

# CopyAs_Category_TextFormat
source: Text format
ar: تنسيق نصي
cs: Textový formát
el: Μορφή κειμένου
es: Formato de texto
fa: قالب متنی
fr: Format texte
hu: Szövegformátum
id: Format teks
it: Formato di testo
ja: テキスト形式
ko: 텍스트 형식
pl: Format tekstowy
pt: Formato de texto
ro: Format text
ru: Текстовый формат
th: รูปแบบข้อความ
tr: Metin biçimi
uk: Текстовий формат
vi: Định dạng văn bản
zh_hans: 文本格式
zh_hant: 文字格式

# CopyAs_Category_Position
source: Position
ar: الموضع
cs: Pozice
el: Θέση
es: Posición
fa: موقعیت
hu: Pozíció
id: Posisi
it: Posizione
ja: 位置
ko: 위치
pl: Pozycja
pt: Posição
ro: Poziție
ru: Позиция
th: ตำแหน่ง
tr: Konum
uk: Позиція
vi: Vị trí
zh_hans: 位置
zh_hant: 位置

# CopyAs_BytesPerLine
source: Bytes per line
ar: البايتات في كل سطر
cs: Bajtů na řádek
de: Bytes pro Zeile
el: Byte ανά γραμμή
es: Bytes por línea
fa: بایت در هر سطر
fr: Octets par ligne
hu: Bájt soronként
id: Byte per baris
it: Byte per riga
ja: 1 行のバイト数
ko: 줄당 바이트 수
pl: Bajty na wiersz
pt: Bytes por linha
ro: Octeți pe linie
ru: Байт в строке
th: ไบต์ต่อบรรทัด
tr: Satır başına bayt
uk: Байтів у рядку
vi: Số byte mỗi dòng
zh_hans: 每行字节数
zh_hant: 每行位元組數

# CopyAs_UpperCase
source: Uppercase hex
ar: Hex بأحرف كبيرة
cs: Velká písmena v šestnáctkové soustavě
de: Hex in Großbuchstaben
el: Κεφαλαία Hex
es: Hex en mayúsculas
fa: Hex با حروف بزرگ
fr: Hex en majuscules
hu: Nagybetűs hexadecimális
id: Hex huruf besar
it: Hex maiuscolo
ja: 16 進を大文字にする
ko: 16진수 대문자
pl: Hex wielkimi literami
pt: Hex em maiúsculas
ro: Hex cu majuscule
ru: Hex прописными буквами
th: Hex ตัวพิมพ์ใหญ่
tr: Büyük harf hex
uk: Hex великими літерами
vi: Hex chữ hoa
zh_hans: 大写十六进制
zh_hant: 大寫十六進位

# CopyAs_NewLine
source: Line breaks
ar: فواصل الأسطر
cs: Konce řádků
de: Zeilenumbrüche
el: Αλλαγές γραμμής
es: Saltos de línea
fa: شکست خط
fr: Sauts de ligne
hu: Sortörések
id: Baris baru
it: Interruzioni di riga
ja: 改行
ko: 줄 바꿈
pl: Podziały wierszy
pt: Quebras de linha
ro: Sfârșituri de linie
ru: Разрывы строк
th: การขึ้นบรรทัดใหม่
tr: Satır sonları
uk: Розриви рядків
vi: Ngắt dòng
zh_hans: 换行符
zh_hant: 換行字元

# CopyAs_Indent
source: Indent
ar: المسافة البادئة
cs: Odsazení
de: Einzug
el: Εσοχή
es: Sangría
fa: تورفتگی
fr: Retrait
hu: Behúzás
id: Indentasi
it: Rientro
ja: インデント
ko: 들여쓰기
pl: Wcięcie
pt: Recuo
ro: Indentare
ru: Отступ
th: การเยื้อง
tr: Girinti
uk: Відступ
vi: Thụt lề
zh_hans: 缩进
zh_hant: 縮排

# CopyAs_Indent4
source: 4 spaces
ar: 4 مسافات
cs: 4 mezery
de: 4 Leerzeichen
el: 4 κενά
es: 4 espacios
fa: 4 فاصله
fr: 4 espaces
hu: 4 szóköz
id: 4 spasi
it: 4 spazi
ja: 空白 4 個
ko: 공백 4개
pl: 4 spacje
pt: 4 espaços
ro: 4 spații
ru: 4 пробела
th: ช่องว่าง 4 ช่อง
tr: 4 boşluk
uk: 4 пробіли
vi: 4 dấu cách
zh_hans: 4 个空格
zh_hant: 4 個空格

# CopyAs_Indent2
source: 2 spaces
ar: مسافتان
cs: 2 mezery
de: 2 Leerzeichen
el: 2 κενά
es: 2 espacios
fa: 2 فاصله
fr: 2 espaces
hu: 2 szóköz
id: 2 spasi
it: 2 spazi
ja: 空白 2 個
ko: 공백 2개
pl: 2 spacje
pt: 2 espaços
ro: 2 spații
ru: 2 пробела
th: ช่องว่าง 2 ช่อง
tr: 2 boşluk
uk: 2 пробіли
vi: 2 dấu cách
zh_hans: 2 个空格
zh_hant: 2 個空格

# CopyAs_IndentTab
source: Tab
ar: علامة جدولة
cs: Tabulátor
de: Tabulator
es: Tabulación
fr: Tabulation
hu: Tabulátor
it: Tabulazione
ja: タブ
ko: 탭
pl: Tabulator
pt: Tabulação
ru: Табуляция
th: แท็บ
tr: Sekme
uk: Табуляція
zh_hans: 制表符
zh_hant: 定位字元

# CopyAs_Variable
source: Variable name
ar: اسم المتغير
cs: Název proměnné
de: Variablenname
el: Όνομα μεταβλητής
es: Nombre de la variable
fa: نام متغیر
fr: Nom de variable
hu: Változónév
id: Nama variabel
it: Nome variabile
ja: 変数名
ko: 변수 이름
pl: Nazwa zmiennej
pt: Nome da variável
ro: Nume variabilă
ru: Имя переменной
th: ชื่อตัวแปร
tr: Değişken adı
uk: Ім’я змінної
vi: Tên biến
zh_hans: 变量名
zh_hant: 變數名稱
